Revit 2026 API

# NonContinuousRailInfoIsValidNonContinuousRailProfile Method

---

Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidNonContinuousRailProfile(
	ElementId profileId
)
```
```vb
Public Function IsValidNonContinuousRailProfile (
	profileId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidNonContinuousRailProfile(
	ElementId^ profileId
)
```
```fsharp
member IsValidNonContinuousRailProfile :
        profileId : ElementId -> bool
```

#### Parameters

profileId ElementId
     The profile Id to be checked.

#### Return Value

Boolean True if the ElementId refers to a valid NonContinuousRail profile, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

InvalidElementId is considered a valid NonContinuousRail profile (the default profile).

#### Reference

NonContinuousRailInfo Class

Autodesk.Revit.DB.Architecture Namespace